# PANDAS Series

## Imports

In [793]:
import numpy as np
import pandas as pd

# Operations on Series

## Create Series from List

In [794]:
country = ['India','Pakistan','USA','Nepal','Srilanka']

print("1->Series\n",pd.Series(country))
print()
print("2->Index\n",pd.Series(country).index)

1->Series
 0       India
1    Pakistan
2         USA
3       Nepal
4    Srilanka
dtype: object

2->Index
 RangeIndex(start=0, stop=5, step=1)

## Create Series from dictionary

In [795]:
#The keys of the dictionary become the index of the Series.

marks = {
    'maths':67,
    'english':57,
    'science':89,
    'hindi':100
}

marks_series = pd.Series(marks,name='Shanmukh Marks')
print("1->Series\n",marks_series)
print()
print("2->Index\n",marks_series.index)
print()
print("3->Maths\n",marks_series['maths'])
print()
print("Data Type\n",marks_series.dtype)
print()
print("Is Data Unique???",marks_series.is_unique)
print()

1->Series
 maths       67
english     57
science     89
hindi      100
Name: Shanmukh Marks, dtype: int64

2->Index
 Index(['maths', 'english', 'science', 'hindi'], dtype='object')

3->Maths
 67

Data Type
 int64

Is Data Unique??? True

## Additional Functions For Pandas Series

In [796]:
import pandas as pd

# Example Series
marks_series = pd.Series([85, 92, 78, 92, 88], index=['Alice', 'Bob', 'Charlie', 'David', 'Eva'])

print("üéØ Mean of marks:")
print(marks_series.mean(), "\n")

print("üî∫ Maximum mark:")
print(marks_series.max(), "\n")

print("üîª Minimum mark:")
print(marks_series.min(), "\n")

print("üî¢ Sum of all marks:")
print(marks_series.sum(), "\n")

print("‚ûï Applying lambda (x + 2) to each element:")
print(marks_series.apply(lambda x: x + 2), "\n")

print("‚ûï Adding 5 to each mark:")
print(marks_series + 5, "\n")

print("‚úñÔ∏è Multiplying each mark by 2:")
print(marks_series * 2, "\n")

print("üîù First 2 elements:")
print(marks_series.head(2), "\n")

print("üîö Last 2 elements:")
print(marks_series.tail(2), "\n")

print("üìä Series sorted by values:")
print(marks_series.sort_values(), "\n")

print("üìá Series sorted by index:")
print(marks_series.sort_index(), "\n")

print("üìà Frequency of each unique mark:")
print(marks_series.value_counts(), "\n")

üéØ Mean of marks:
87.0

üî∫ Maximum mark:
92

üîª Minimum mark:
78

üî¢ Sum of all marks:
435

‚ûï Applying lambda (x + 2) to each element:
Alice      87
Bob        94
Charlie    80
David      94
Eva        90
dtype: int64

‚ûï Adding 5 to each mark:
Alice      90
Bob        97
Charlie    83
David      97
Eva        93
dtype: int64

‚úñÔ∏è Multiplying each mark by 2:
Alice      170
Bob        184
Charlie    156
David      184
Eva        176
dtype: int64

üîù First 2 elements:
Alice    85
Bob      92
dtype: int64

üîö Last 2 elements:
David    92
Eva      88
dtype: int64

üìä Series sorted by values:
Charlie    78
Alice      85
Eva        88
Bob        92
David      92
dtype: int64

üìá Series sorted by index:
Alice      85
Bob        92
Charlie    78
David      92
Eva        88
dtype: int64

üìà Frequency of each unique mark:
92    2
85    1
78    1
88    1
Name: count, dtype: int64

In [797]:
# custom index
marks = [67,57,89,89]
subjects = ['maths','english','science','hindi']

print("1->Series\n",pd.Series(marks,index=subjects))
print()
print("2->Index\n",pd.Series(marks,index=subjects).index)
print()
print("3->Maths\n",pd.Series(marks,index=subjects)['maths'])
print()
print("Data Type\n",pd.Series(marks,index=subjects).dtype)
print()
print("Is Data Unique???",pd.Series(marks,index=subjects).is_unique)
print()

1->Series
 maths      67
english    57
science    89
hindi      89
dtype: int64

2->Index
 Index(['maths', 'english', 'science', 'hindi'], dtype='object')

3->Maths
 67

Data Type
 int64

Is Data Unique??? False

In [798]:
import pandas as pd

s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)
s2 = pd.Series([1, 2, 3], index=['a', 'b', 'e'])
print(s + s2)     # NaN for unmatched indexes

a    10
b    20
c    30
d    40
dtype: int64
a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
dtype: float64

In [799]:

series = pd.Series([1,2,'Python', 2.0, True, 100])
#ignore->Does nothing if any non-numeric values are present.
#ignore->Forces the conversion Non-convertible values are replaced with NaN
print(pd.to_numeric(series, errors ='ignore') )
print(pd.to_numeric(series, errors ='coerce') )

0         1
1         2
2    Python
3       2.0
4      True
5       100
dtype: object
0      1.0
1      2.0
2      NaN
3      2.0
4      1.0
5    100.0
dtype: float64

C:\Users\Adari Shanmukh\AppData\Local\Temp\ipykernel_5984\2999302811.py:4: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  print(pd.to_numeric(series, errors ='ignore') )

# Opearations on DataFrame

In [800]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie','Charlie'],'Age': [25, 30, 22,22],'Score': [85.5, 190.0, 95.5,95.5]}
df_test = pd.DataFrame(data,index=['A', 'B', 'C','D'])

print("üîç DataFrame:\n", df_test, "\n")
print("üîçTranspose of a DataFrame:\n", df_test.T, "\n")
print("üîçLoc\n", df_test.T.loc['Name'], "\n")
print("üîçiLoc\n", df_test.T.iloc[0], "\n")

üîç DataFrame:
       Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
C  Charlie   22   95.5
D  Charlie   22   95.5

üîçTranspose of a DataFrame:
            A      B        C        D
Name   Alice    Bob  Charlie  Charlie
Age       25     30       22       22
Score   85.5  190.0     95.5     95.5

üîçLoc
 A      Alice
B        Bob
C    Charlie
D    Charlie
Name: Name, dtype: object

üîçiLoc
 A      Alice
B        Bob
C    Charlie
D    Charlie
Name: Name, dtype: object

In [801]:
print("üìã Columns:\n", df_test.columns, "\n")
print("üî¢ First row (iloc):\n", df_test.iloc[0], "\n")         # By position
print("üéØ Age column:\n", df_test['Age'], "\n")                # By column label
print("ü™™ Row by label (loc):\n", df_test.loc['A'], "\n")        # By index

üìã Columns:
 Index(['Name', 'Age', 'Score'], dtype='object')

üî¢ First row (iloc):
 Name     Alice
Age         25
Score     85.5
Name: A, dtype: object

üéØ Age column:
 A    25
B    30
C    22
D    22
Name: Age, dtype: int64

ü™™ Row by label (loc):
 Name     Alice
Age         25
Score     85.5
Name: A, dtype: object

In [802]:
df_test.isna().sum() # Check for missing values

Name     0
Age      0
Score    0
dtype: int64

In [803]:
df = pd.read_csv('D:\\utils\\DataSets\\Scalar\\mckinsey.csv') # We are storing the data in df
df.head(2)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030

In [804]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [805]:
df[['country', 'life_exp']].head(2)

       country  life_exp
0  Afghanistan    28.801
1  Afghanistan    30.332

In [806]:
df['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [807]:
df['country'].value_counts()

country
Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: count, Length: 142, dtype: int64

In [808]:
df['gdp']=df['gdp_cap'] * df['population']
df.head(1)

       country  year  population continent  life_exp     gdp_cap           gdp
0  Afghanistan  1952     8425333      Asia    28.801  779.445314  6.567086e+09

## Renaming Columns

In [809]:
#Column Renaming left to right
df.rename({"population": "Population", "country":"Country" }, axis = 1).head(1)

       Country  year  Population continent  life_exp     gdp_cap           gdp
0  Afghanistan  1952     8425333      Asia    28.801  779.445314  6.567086e+09

In [810]:
#or 
df.rename(columns={"population":"Population","life_exp":"Life_Exp"}).head(1)

       country  year  Population continent  Life_Exp     gdp_cap           gdp
0  Afghanistan  1952     8425333      Asia    28.801  779.445314  6.567086e+09

In [811]:
#Renaming rows top to bottom here 0 and 1 are the index values of the rows
df.rename({0: "Zero",1:"One"}, axis = 0).head(1)

,country,year,population,continent,life_exp,gdp_cap,gdp
Zero,Afghanistan,1952,8425333,Asia,28.801,779.445314,6.567086e+09

## Drop Columns

In [812]:
df.drop(columns=['continent']).head(1)

       country  year  population  life_exp     gdp_cap           gdp
0  Afghanistan  1952     8425333    28.801  779.445314  6.567086e+09

## Loc and Iloc Operations

In [813]:
df.iloc[[1, 2, 0]]

       country  year  population continent  life_exp     gdp_cap           gdp
1  Afghanistan  1957     9240934      Asia    30.332  820.853030  7.585449e+09
2  Afghanistan  1962    10267083      Asia    31.997  853.100710  8.758856e+09
0  Afghanistan  1952     8425333      Asia    28.801  779.445314  6.567086e+09

In [814]:
df_test.loc[['B', 'C', 'A']]

      Name  Age  Score
B      Bob   30  190.0
C  Charlie   22   95.5
A    Alice   25   85.5

In [815]:
# loc and iloc are used to access a group of rows and columns by labels or a boolean array.
df_test.iloc[1:3, 0:3:2]

      Name  Score
B      Bob  190.0
C  Charlie   95.5

In [816]:
df_test.loc['A':'C', ['Name', 'Age']].head(5)

      Name  Age
A    Alice   25
B      Bob   30
C  Charlie   22

## Set and Reset Index

In [817]:
df_test.set_index('Name').head(2) # Set index to country column

       Age  Score
Name
Alice   25   85.5
Bob     30  190.0

In [818]:
df_test.set_index('Name').head(2).loc['Alice']

Age      25.0
Score    85.5
Name: Alice, dtype: float64

In [819]:
df_test.set_index('Name').head(2).iloc[0] # Get first row by position

Age      25.0
Score    85.5
Name: Alice, dtype: float64

In [820]:
df_test

      Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
C  Charlie   22   95.5
D  Charlie   22   95.5

## check and remove duplicates

In [821]:
df_test.duplicated()

A    False
B    False
C    False
D     True
dtype: bool

In [822]:
df_test[df_test.duplicated()]

      Name  Age  Score
D  Charlie   22   95.5

In [823]:
df_test.drop_duplicates()

      Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
C  Charlie   22   95.5

In [824]:
#### But how can we decide among all duplicate rows which ones we want to keep ?

#Here we can use argument **keep**: 

#This Controls how to consider duplicate value. 

#It has only three distinct value 
#- `first`
#- `last`
#- `False`

#The default is ‚Äòfirst‚Äô. 

#If `first`, this considers first value as unique and rest of the same values as duplicate.

df_test.drop_duplicates(keep='last')

      Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
D  Charlie   22   95.5

In [825]:
df_test.drop_duplicates(keep='first')

      Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
C  Charlie   22   95.5

In [826]:
df_test.drop_duplicates(subset=['Name'],keep='first')

      Name  Age  Score
A    Alice   25   85.5
B      Bob   30  190.0
C  Charlie   22   95.5

## Sorting

In [827]:
df_test.sort_values(['Age'])

      Name  Age  Score
C  Charlie   22   95.5
D  Charlie   22   95.5
A    Alice   25   85.5
B      Bob   30  190.0

In [828]:
df_test.sort_values(['Age', 'Score'], ascending=[True, False])

      Name  Age  Score
C  Charlie   22   95.5
D  Charlie   22   95.5
A    Alice   25   85.5
B      Bob   30  190.0

## Merging DataFrames

In [829]:
users = pd.DataFrame({"userid":[1, 2, 3], "name":["sharadh", "shahid", "khusalli"], "rollno":[23, 24, 25]})
users

   userid      name  rollno
0       1   sharadh      23
1       2    shahid      24
2       3  khusalli      25

In [830]:
msgs = pd.DataFrame({"userid":[1, 2, 4], "msg":["acha", "theek hai", "nice"],"rollno":[23, 24, 125]})
msgs

   userid        msg  rollno
0       1       acha      23
1       2  theek hai      24
2       4       nice     125

In [831]:
pd.merge(users, msgs, left_on='userid',right_on='userid', how='inner',suffixes=('_user', '_msg'))

   userid     name  rollno_user        msg  rollno_msg
0       1  sharadh           23       acha          23
1       2   shahid           24  theek hai          24

In [832]:
merged_data_inner = pd.merge(users, msgs, on='userid', how='inner',suffixes=('_user', '_msg'))
merged_data_inner

   userid     name  rollno_user        msg  rollno_msg
0       1  sharadh           23       acha          23
1       2   shahid           24  theek hai          24

In [833]:
merged_data_left = pd.merge(users, msgs, on='userid', how='left',suffixes=('_user', '_msg'))
merged_data_left

   userid      name  rollno_user        msg  rollno_msg
0       1   sharadh           23       acha        23.0
1       2    shahid           24  theek hai        24.0
2       3  khusalli           25        NaN         NaN

In [834]:
merged_data_right = pd.merge(users, msgs, on='userid', how='right',suffixes=('_user', '_msg'))
merged_data_right

   userid     name  rollno_user        msg  rollno_msg
0       1  sharadh         23.0       acha          23
1       2   shahid         24.0  theek hai          24
2       4      NaN          NaN       nice         125

In [835]:
merged_data_outer = pd.merge(users, msgs, on='userid', how='outer',suffixes=('_user', '_msg'))
merged_data_outer

   userid      name  rollno_user        msg  rollno_msg
0       1   sharadh         23.0       acha        23.0
1       2    shahid         24.0  theek hai        24.0
2       3  khusalli         25.0        NaN         NaN
3       4       NaN          NaN       nice       125.0

In [836]:
pd.concat([users, msgs])

   userid      name  rollno        msg
0       1   sharadh      23        NaN
1       2    shahid      24        NaN
2       3  khusalli      25        NaN
0       1       NaN      23       acha
1       2       NaN      24  theek hai
2       4       NaN     125       nice

In [837]:
pd.concat([users, msgs], ignore_index = True)

   userid      name  rollno        msg
0       1   sharadh      23        NaN
1       2    shahid      24        NaN
2       3  khusalli      25        NaN
3       1       NaN      23       acha
4       2       NaN      24  theek hai
5       4       NaN     125       nice

In [838]:
users['rollno'].isin(msgs['rollno'])

0     True
1     True
2    False
Name: rollno, dtype: bool

In [839]:
np.all(users['rollno'].isin(msgs['rollno']))

False

In [840]:
np.any(users['rollno'].isin(msgs['rollno']))

True


- **Grouping**
    - Split, Apply, Combine
    - `groupby()`
- **Group based Aggregates**

- **Group based Filtering**

#### How can you find the average popularity of each director?

We will have to some group our rows director wise.


#### What is Grouping ?

Simply it could be understood through the terms - Split, apply, combine

<img src="https://learning.oreilly.com/api/v2/epubs/urn:orm:book:9781491912126/files/assets/pyds_03in01.png" height = 350/>

1. **Split**: **Breaking up and grouping** a DataFrame depending on the value of the specified key.

2. **Apply**: Computing **some functio**n, usually an **aggregate, transformation, or filtering**, within the individual groups.

3. **Combine**: **Merge the results** of these operations into an output array.

In [841]:
#country	year	population	continent	life_exp	gdp_cap	
df.groupby('country').ngroups

142

In [842]:
df.groupby('country').groups

{'Afghanistan': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], 'Albania': [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23], 'Algeria': [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35], 'Angola': [36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47], 'Argentina': [48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59], 'Australia': [60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71], 'Austria': [72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83], 'Bahrain': [84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95], 'Bangladesh': [96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107], 'Belgium': [108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119], 'Benin': [120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131], 'Bolivia': [132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143], 'Bosnia and Herzegovina': [144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155], 'Botswana': [156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167], 'Brazil': [168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179], 'Bulgaria': [180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191], 'Burkina Faso': [192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203], 'Burundi': [204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215], 'Cambodia': [216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227], 'Cameroon': [228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239], 'Canada': [240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251], 'Central African Republic': [252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263], 'Chad': [264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275], 'Chile': [276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287], 'China': [288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299], 'Colombia': [300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311], 'Comoros': [312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323], 'Congo, Dem. Rep.': [324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335], 'Congo, Rep.': [336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347], 'Costa Rica': [348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359], 'Cote d'Ivoire': [360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371], 'Croatia': [372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383], 'Cuba': [384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395], 'Czech Republic': [396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407], 'Denmark': [408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419], 'Djibouti': [420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431], 'Dominican Republic': [432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443], 'Ecuador': [444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455], 'Egypt': [456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467], 'El Salvador': [468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479], 'Equatorial Guinea': [480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491], 'Eritrea': [492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503], 'Ethiopia': [504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515], 'Finland': [516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527], 'France': [528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539], 'Gabon': [540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551], 'Gambia': [552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563], 'Germany': [564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575], 'Ghana': [576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587], 'Greece': [588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599], 'Guatemala': [600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611], 'Guinea': [612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623], 'Guinea-Bissau': [624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635], 'Haiti': [636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647], 'Honduras': [648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659], 'Hong Kong, China': [660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671], 'Hungary': [672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683], 'Iceland': [684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695], 'India': [696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707], 'Indonesia': [708, 709, 710, 711, 712, 713, 714, 715, 716, 717, 718, 719], 'Iran': [720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731], 'Iraq': [732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743], 'Ireland': [744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755], 'Israel': [756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767], 'Italy': [768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779], 'Jamaica': [780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791], 'Japan': [792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803], 'Jordan': [804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 814, 815], 'Kenya': [816, 817, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827], 'Korea, Dem. Rep.': [828, 829, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839], 'Korea, Rep.': [840, 841, 842, 843, 844, 845, 846, 847, 848, 849, 850, 851], 'Kuwait': [852, 853, 854, 855, 856, 857, 858, 859, 860, 861, 862, 863], 'Lebanon': [864, 865, 866, 867, 868, 869, 870, 871, 872, 873, 874, 875], 'Lesotho': [876, 877, 878, 879, 880, 881, 882, 883, 884, 885, 886, 887], 'Liberia': [888, 889, 890, 891, 892, 893, 894, 895, 896, 897, 898, 899], 'Libya': [900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911], 'Madagascar': [912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922, 923], 'Malawi': [924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935], 'Malaysia': [936, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947], 'Mali': [948, 949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959], 'Mauritania': [960, 961, 962, 963, 964, 965, 966, 967, 968, 969, 970, 971], 'Mauritius': [972, 973, 974, 975, 976, 977, 978, 979, 980, 981, 982, 983], 'Mexico': [984, 985, 986, 987, 988, 989, 990, 991, 992, 993, 994, 995], 'Mongolia': [996, 997, 998, 999, 1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007], 'Montenegro': [1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019], 'Morocco': [1020, 1021, 1022, 1023, 1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031], 'Mozambique': [1032, 1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043], 'Myanmar': [1044, 1045, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055], 'Namibia': [1056, 1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067], 'Nepal': [1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078, 1079], 'Netherlands': [1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089, 1090, 1091], 'New Zealand': [1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103], 'Nicaragua': [1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111, 1112, 1113, 1114, 1115], 'Niger': [1116, 1117, 1118, 1119, 1120, 1121, 1122, 1123, 1124, 1125, 1126, 1127], 'Nigeria': [1128, 1129, 1130, 1131, 1132, 1133, 1134, 1135, 1136, 1137, 1138, 1139], 'Norway': [1140, 1141, 1142, 1143, 1144, 1145, 1146, 1147, 1148, 1149, 1150, 1151], 'Oman': [1152, 1153, 1154, 1155, 1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163], 'Pakistan': [1164, 1165, 1166, 1167, 1168, 1169, 1170, 1171, 1172, 1173, 1174, 1175], 'Panama': [1176, 1177, 1178, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187], 'Paraguay': [1188, 1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 1199], ...}

In [843]:
df.groupby('country').get_group('Afghanistan')

,country,year,population,continent,life_exp,gdp_cap,gdp
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,6.567086e+09
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,7.585449e+09
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,8.758856e+09
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,9.648014e+09
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,9.678553e+09
5,Afghanistan,1977,14880372,Asia,38.438,786.113360,1.169766e+10
6,Afghanistan,1982,12881816,Asia,39.854,978.011439,1.259856e+10
7,Afghanistan,1987,13867957,Asia,40.822,852.395945,1.182099e+10
8,Afghanistan,1992,16317921,Asia,41.674,649.341395,1.059590e+10
9,Afghanistan,1997,22227415,Asia,41.763,635.341351,1.412200e+10
10,Afghanistan,2002,25268405,Asia,42.129,726.734055,1.836341e+10
11,Afghanistan,2007,31889923,Asia,43.828,974.580338,3.107929e+10

In [844]:
df.groupby(['country','year'])['life_exp'].aggregate(['min', 'max'])

                     min     max
country     year
Afghanistan 1952  28.801  28.801
            1957  30.332  30.332
            1962  31.997  31.997
            1967  34.020  34.020
            1972  36.088  36.088
...                  ...     ...
Zimbabwe    1987  62.351  62.351
            1992  60.377  60.377
            1997  46.809  46.809
            2002  39.989  39.989
            2007  43.487  43.487

[1704 rows x 2 columns]

Notice what's happening here?
- We first group data by director and then use `groupby().filter` function
- **Groups are filtered if they do not satisfy the boolean criterion** specified by function
- This is called  **Group Based Filtering**

In [845]:
df.groupby('country').filter(lambda x: x["life_exp"].max() >= 80)

,country,year,population,continent,life_exp,gdp_cap,gdp
60,Australia,1952,8691212,Oceania,69.120,10039.59564,8.725625e+10
61,Australia,1957,9712569,Oceania,70.330,10949.64959,1.063492e+11
62,Australia,1962,10794968,Oceania,70.930,12217.22686,1.318846e+11
63,Australia,1967,11872264,Oceania,71.100,14526.12465,1.724580e+11
64,Australia,1972,13177000,Oceania,71.930,16788.62948,2.212238e+11
...,...,...,...,...,...,...,...
1483,Switzerland,1987,6649942,Europe,77.410,30281.70459,2.013716e+11
1484,Switzerland,1992,6995447,Europe,78.030,31871.53030,2.229556e+11
1485,Switzerland,1997,7193761,Europe,79.370,32135.32301,2.311738e+11
1486,Switzerland,2002,7361757,Europe,80.620,34480.95771,2.538404e+11
1487,Switzerland,2007,7554661,Europe,81.701,37506.41907,2.833483e+11


  - **Restructuring data** 
    - pd.melt()
    - pd.pivot()

    - pd.pivot_table()
  - Dealing with Missing Values
    - None and nan values
    - isna() and isnull()

## üîÑ Melting in Pandas (pd.melt)
üîç What is it?
- pd.melt() transforms a wide-format DataFrame into a long-format (or "tidy") one.
-  It's useful for: Unpivoting columns into rows Making data analysis and visualization easier

In [872]:
import pandas as pd

# Sample data
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [90, 80, 85],
    'Science': [88, 82, 91]
})

print(df)

      Name  Math  Science
0    Alice    90       88
1      Bob    80       82
2  Charlie    85       91

In [873]:
# Melt the dataframe
melted_df = pd.melt(df, id_vars=['Name'], var_name='Subject', value_name='Score')

print(melted_df)

      Name  Subject  Score
0    Alice     Math     90
1      Bob     Math     80
2  Charlie     Math     85
3    Alice  Science     88
4      Bob  Science     82
5  Charlie  Science     91

In [874]:
import pandas as pd

# Sample long-format data
df = pd.DataFrame({
    'Name': ['Alice', 'Alice', 'Bob', 'Bob'],
    'Subject': ['Math', 'Science', 'Math', 'Science'],
    'Score': [90, 88, 80, 82]
})

# Pivot
pivot_df = df.pivot(index='Name', columns='Subject', values='Score')
print(pivot_df)

Subject  Math  Science
Name
Alice      90       88
Bob        80       82

In [875]:
# Add a duplicate row
df = pd.DataFrame({
    'Name': ['Alice', 'Alice', 'Alice', 'Bob', 'Bob'],
    'Subject': ['Math', 'Math', 'Science', 'Math', 'Science'],
    'Score': [90, 92, 88, 80, 82]
})

# Pivot table with mean as default aggregation
pivot_tbl = pd.pivot_table(df, index='Name', columns='Subject', values='Score', aggfunc='mean')
print(pivot_tbl)

Subject  Math  Science
Name
Alice    91.0     88.0
Bob      80.0     82.0

In [876]:
df = pd.DataFrame({
    'Region': ['East', 'West'],
    'Q1': [200, 150],
    'Q2': [210, 180],
    'Q3': [190, 170],
    'Q4': [220, 160]
})

melted = pd.melt(df, id_vars=['Region'], value_vars=['Q1','Q2'],var_name='Quarter', value_name='Sales')
print(melted)

  Region Quarter  Sales
0   East      Q1    200
1   West      Q1    150
2   East      Q2    210
3   West      Q2    180

In [877]:
df = pd.DataFrame({
    'Country': ['USA', 'USA', 'Canada', 'Canada'],
    'Year': [2020, 2021, 2020, 2021],
    'GDP': [21.4, 22.7, 1.8, 2.0],
    'Population': [331, 332, 38, 38.2]
})

melted = pd.melt(df, id_vars=['Country', 'Year'], var_name='Indicator', value_name='Value')
print(melted)

  Country  Year   Indicator  Value
0     USA  2020         GDP   21.4
1     USA  2021         GDP   22.7
2  Canada  2020         GDP    1.8
3  Canada  2021         GDP    2.0
4     USA  2020  Population  331.0
5     USA  2021  Population  332.0
6  Canada  2020  Population   38.0
7  Canada  2021  Population   38.2